#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
random_pet.secret_name: Refreshing state... [id=strangely-steady-monkfish]
random_password.master: Refreshing state... [id=none]
module.memory.module.lambda_function_container_image.data.aws_caller_identity.current: Reading...
module.list_collections.module.lambda_function_container_image.data.aws_iam_policy_document.assume_role[0]: Reading...
aws_api_gateway_api_key.this: Refreshing state... [id=mwfvag0h0f]
aws_db_parameter_group.default: Refreshing state... [id=rds-pg]
data.aws_ami.latest_amazon_linux: Reading...
data.aws_availability_zones.available: Reading...
module.email_response_processor.module.lambda_function_container_image.data.aws_partition.current: Reading...
module.email_request_processor.module.lambda_function_container_image.aws_cloudwatch_log_group.lambda[0]: Refreshing state... [id=/aws/lambda/levio-demo-fev-email-request-processor-dev]
aws_secretsmanager_secret.password: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:446872271111:secret:vectordb-password-main-strangely-steady-monkfish-dKgTZD]
module.email_response_processor.module.lambda_function_container_image.data.aws_partition.current: Read complete after 0s [id=aws]
module.list_collections.module.lambda_function_container_image.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.list_collections.module.lambda_function_container_image.aws_cloudwatch_log_group.lambda[0]: Refreshing state... [id=/aws/lambda/levio-demo-fev-list-collections-dev]
module.memory.module.lambda_function_container_image.data.aws_caller_identity.current: Read complete after 0s [id=446872271111]
aws_api_gateway_rest_api.this: Refreshing state... [id=d09uj3e9kh]
aws_iam_role.this: Refreshing state... [id=levio-demo-fev-api-role]
module.lex_router.module.lambda_function_container_image.data.aws_iam_policy_document.assume_role[0]: Reading...
module.lex_router.module.lambda_function_container_image.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.ingestion.aws_sqs_queue.dead_letter_queue: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/446872271111/levio-demo-fev-ingestion-queue-dev_dead_letter]
data.aws_availability_zones.available: Read complete after 0s [id=us-east-1]
module.list_collections.data.aws_ecr_image.lambda_image: Reading...
module.list_collections.module.api_gateway.data.aws_caller_identity.current: Reading...
module.list_collections.module.api_gateway.data.aws_caller_identity.current: Read complete after 0s [id=446872271111]
module.ingestion.module.lambda_function_container_image.data.aws_region.current: Reading...
module.email_response_processor.module.lambda_function_container_image.data.aws_caller_identity.current: Reading...
module.email_request_processor.data.aws_ecr_image.lambda_image: Reading...
module.ingestion.module.lambda_function_container_image.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.memory.module.lambda_function_container_image.data.aws_iam_policy_document.assume_role[0]: Reading...
module.inference.module.lambda_function_container_image.data.aws_iam_policy_document.assume_role[0]: Reading...
module.memory.module.lambda_function_container_image.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.inference.module.lambda_function_container_image.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.memory.module.lambda_function_container_image.aws_cloudwatch_log_group.lambda[0]: Refreshing state... [id=/aws/lambda/levio-demo-fev-memory-dev]
module.lex_router.module.lambda_function_container_image.data.aws_iam_policy_document.additional_inline[0]: Reading...
module.lex_router.module.lambda_function_container_image.data.aws_iam_policy_document.additional_inline[0]: Read complete after 0s [id=1348983281]
module.email_response_processor.module.lambda_function_container_image.data.aws_caller_identity.current: Read complete after 0s [id=446872271111]
module.memory.data.aws_ecr_image.lambda_image: Reading...
module.email_response_processor.module.fifo_sqs.aws_sqs_queue.this[0]: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/446872271111/levio-demo-fev-email-response-processor-queue-dev.fifo]
module.list_collections.module.lambda_function_container_image.data.aws_region.current: Reading...
module.list_collections.module.lambda_function_container_image.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.inference.module.lambda_function_container_image.data.aws_partition.current: Reading...
module.inference.module.lambda_function_container_image.data.aws_partition.current: Read complete after 0s [id=aws]
module.email_response_processor.data.aws_ecr_image.lambda_image: Reading...
module.email_request_processor.module.lambda_function_container_image.data.aws_region.current: Reading...
module.email_request_processor.module.lambda_function_container_image.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.memory.module.lambda_function_container_image.data.aws_iam_policy_document.additional_inline[0]: Reading...
module.email_response_processor.module.lambda_function_container_image.data.aws_iam_policy_document.assume_role[0]: Reading...
module.memory.module.lambda_function_container_image.data.aws_iam_policy_document.additional_inline[0]: Read complete after 0s [id=3277652423]
module.ingestion.module.lambda_function_container_image.data.aws_iam_policy_document.assume_role[0]: Reading...
module.email_response_processor.module.lambda_function_container_image.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.email_response_processor.data.aws_caller_identity.current: Reading...
module.lex_router.module.lambda_function_container_image.data.aws_region.current: Reading...
module.lex_router.module.lambda_function_container_image.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.ingestion.module.lambda_function_container_image.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.memory.module.lambda_function_container_image.data.aws_partition.current: Reading...
module.lex_router.data.aws_ecr_image.lambda_image: Reading...
module.memory.module.lambda_function_container_image.data.aws_partition.current: Read complete after 0s [id=aws]
module.list_collections.module.lambda_function_container_image.data.aws_caller_identity.current: Reading...
module.lex_router.module.lambda_function_container_image.data.aws_partition.current: Reading...
module.lex_router.module.lambda_function_container_image.data.aws_partition.current: Read complete after 0s [id=aws]
module.email_response_processor.data.aws_caller_identity.current: Read complete after 0s [id=446872271111]
module.inference.module.lambda_function_container_image.data.aws_region.current: Reading...
module.email_request_processor.module.lambda_function_container_image.data.aws_partition.current: Reading...
module.inference.module.lambda_function_container_image.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.email_request_processor.module.lambda_function_container_image.data.aws_partition.current: Read complete after 0s [id=aws]
module.email_response_processor.module.lambda_function_container_image.data.aws_region.current: Reading...
module.email_response_processor.module.lambda_function_container_image.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-00fb300ee2d2f7b3b]
module.ingestion.aws_s3_bucket.ingestion_source_storage: Refreshing state... [id=levio-demo-fev-storage-dev]
module.list_collections.module.lambda_function_container_image.data.aws_caller_identity.current: Read complete after 0s [id=446872271111]
module.ingestion.module.lambda_function_container_image.data.aws_caller_identity.current: Reading...
module.ingestion.module.lambda_function_container_image.data.aws_caller_identity.current: Read complete after 0s [id=446872271111]
module.list_collections.module.lambda_function_container_image.data.aws_partition.current: Reading...
module.list_collections.module.lambda_function_container_image.data.aws_partition.current: Read complete after 0s [id=aws]
module.memory.module.lambda_function_container_image.data.aws_region.current: Reading...
module.memory.module.lambda_function_container_image.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.email_response_processor.module.lambda_function_container_image.aws_cloudwatch_log_group.lambda[0]: Refreshing state... [id=/aws/lambda/levio-demo-fev-email-response-processor-dev]
module.memory.aws_dynamodb_table.basic-conversation_memory_table-table: Refreshing state... [id=levio-demo-fev-chat-history-dev]
data.aws_ami.latest_amazon_linux: Read complete after 0s [id=ami-03c951bbe993ea087]
module.inference.module.lambda_function_container_image.data.aws_caller_identity.current: Reading...
module.inference.module.lambda_function_container_image.data.aws_caller_identity.current: Read complete after 0s [id=446872271111]
module.inference.module.api_gateway.data.aws_caller_identity.current: Reading...
module.inference.module.api_gateway.data.aws_caller_identity.current: Read complete after 0s [id=446872271111]
module.ingestion.module.lambda_function_container_image.aws_cloudwatch_log_group.lambda[0]: Refreshing state... [id=/aws/lambda/levio-demo-fev-ingestion-dev]
module.email_response_processor.data.aws_ecr_image.lambda_image: Read complete after 0s [id=sha256:d36cbea4c86284dc10feec96e8a33b5822c110b8bfbdb124ea8350abc7e5062d]
module.lex_router.module.lambda_function_container_image.data.aws_caller_identity.current: Reading...
module.lex_router.module.lambda_function_container_image.data.aws_caller_identity.current: Read complete after 0s [id=446872271111]
module.ingestion.module.lambda_function_container_image.data.aws_partition.current: Reading...
module.ingestion.module.lambda_function_container_image.data.aws_partition.current: Read complete after 0s [id=aws]
module.email_request_processor.data.aws_ecr_image.lambda_image: Read complete after 0s [id=sha256:a07910e3db8292dcccb8e03da29f936cbddd4db1ddad0b29afcce68d449a6cd0]
module.email_request_processor.module.lambda_function_container_image.data.aws_iam_policy_document.assume_role[0]: Reading...
module.lex_router.module.lambda_function_container_image.aws_cloudwatch_log_group.lambda[0]: Refreshing state... [id=/aws/lambda/levio-demo-fev-lex-router-dev]
module.email_request_processor.module.lambda_function_container_image.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.inference.data.aws_ecr_image.lambda_image: Reading...
module.email_request_processor.module.lambda_function_container_image.data.aws_caller_identity.current: Reading...
module.email_request_processor.module.lambda_function_container_image.data.aws_caller_identity.current: Read complete after 0s [id=446872271111]
module.ingestion.data.aws_ecr_image.lambda_image: Reading...
module.list_collections.data.aws_ecr_image.lambda_image: Read complete after 0s [id=sha256:fd5c6f197a3aa7e0825fb033420652aeb3f9dd976a93c24b911f4b418d231ceb]
module.email_request_processor.module.fifo_sqs.aws_sqs_queue.this[0]: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/446872271111/levio-demo-fev-email-request-processor-queue-dev.fifo]
module.inference.module.lambda_function_container_image.aws_cloudwatch_log_group.lambda[0]: Refreshing state... [id=/aws/lambda/levio-demo-fev-inference-dev]
module.list_collections.module.lambda_function_container_image.aws_iam_role.lambda[0]: Refreshing state... [id=levio-demo-fev-list-collections-dev-role]
module.lex_router.module.lambda_function_container_image.aws_iam_role.lambda[0]: Refreshing state... [id=levio-demo-fev-lex-router-dev-role]
module.memory.data.aws_ecr_image.lambda_image: Read complete after 0s [id=sha256:1afe8003b3a137e28f2b9825dcaeeb5047c13010b309b66eab2cc7a0d19ab51b]
data.aws_secretsmanager_secret.password: Reading...
module.lex_router.data.aws_ecr_image.lambda_image: Read complete after 0s [id=sha256:ef781dc326e14b8a4af7dd3f52cac4161103297362ff984a8050d27b5710cece]
aws_secretsmanager_secret_version.password: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:446872271111:secret:vectordb-password-main-strangely-steady-monkfish-dKgTZD|terraform-20240126151709956800000002]
module.memory.module.lambda_function_container_image.aws_iam_role.lambda[0]: Refreshing state... [id=levio-demo-fev-memory-dev-role]
module.inference.module.lambda_function_container_image.aws_iam_role.lambda[0]: Refreshing state... [id=levio-demo-fev-inference-dev-role]
module.lex_router.module.lambda_function_container_image.aws_iam_policy.additional_inline[0]: Refreshing state... [id=arn:aws:iam::446872271111:policy/levio-demo-fev-lex-router-dev-role-inline]
data.aws_secretsmanager_secret.password: Read complete after 0s [id=arn:aws:secretsmanager:us-east-1:446872271111:secret:vectordb-password-main-strangely-steady-monkfish-dKgTZD]
module.ingestion.aws_sqs_queue.queue: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/446872271111/levio-demo-fev-ingestion-queue-dev]
module.inference.data.aws_ecr_image.lambda_image: Read complete after 0s [id=sha256:e0f4458197517081bd2170fb7b56654fe41a25a20d38bb504448735bfbb0e194]
aws_api_gateway_authorizer.this: Refreshing state... [id=mi1y1q]
module.memory.module.lambda_function_container_image.aws_iam_policy.additional_inline[0]: Refreshing state... [id=arn:aws:iam::446872271111:policy/levio-demo-fev-memory-dev-role-inline]
module.email_response_processor.module.lambda_function_container_image.aws_iam_role.lambda[0]: Refreshing state... [id=levio-demo-fev-email-response-processor-dev-role]
module.ingestion.module.lambda_function_container_image.aws_iam_role.lambda[0]: Refreshing state... [id=levio-demo-fev-ingestion-dev-role]
aws_iam_role_policy.this: Refreshing state... [id=levio-demo-fev-api-role:this]
aws_api_gateway_account.this: Refreshing state... [id=api-gateway-account]
module.ingestion.data.aws_ecr_image.lambda_image: Read complete after 0s [id=sha256:7129ed47b5edee4cf79729d2ccb4e64e76f5ba1dd9e3373cf233e3f285956a47]
module.email_request_processor.module.lambda_function_container_image.aws_iam_role.lambda[0]: Refreshing state... [id=levio-demo-fev-email-request-processor-dev-role]
data.aws_secretsmanager_secret_version.password: Reading...
module.lex_router.module.lambda_function_container_image.aws_iam_role_policy_attachment.additional_inline[0]: Refreshing state... [id=levio-demo-fev-lex-router-dev-role-20240202183512646400000001]
module.ingestion.data.aws_iam_policy_document.sqs_policy: Reading...
module.ingestion.data.aws_iam_policy_document.sqs_policy: Read complete after 0s [id=1366123725]
module.list_collections.module.lambda_function_container_image.data.aws_iam_policy_document.logs[0]: Reading...
module.list_collections.module.lambda_function_container_image.data.aws_iam_policy_document.logs[0]: Read complete after 0s [id=736838273]
module.email_request_processor.module.lambda_function_container_image.data.aws_iam_policy_document.logs[0]: Reading...
module.email_request_processor.module.lambda_function_container_image.data.aws_iam_policy_document.logs[0]: Read complete after 0s [id=2314128230]
module.inference.module.api_gateway.aws_api_gateway_resource.api_gateway_resource: Refreshing state... [id=c30cce]
module.list_collections.module.api_gateway.aws_api_gateway_resource.api_gateway_resource: Refreshing state... [id=i033qb]
module.email_response_processor.module.lambda_function_container_image.data.aws_iam_policy_document.additional_inline[0]: Reading...
module.email_response_processor.module.lambda_function_container_image.data.aws_iam_policy_document.additional_inline[0]: Read complete after 0s [id=2463471094]
module.memory.module.lambda_function_container_image.data.aws_iam_policy_document.logs[0]: Reading...
module.memory.module.lambda_function_container_image.data.aws_iam_policy_document.logs[0]: Read complete after 0s [id=3522429600]
module.ingestion.aws_sqs_queue_policy.sqs_policy: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/446872271111/levio-demo-fev-ingestion-queue-dev]
module.email_response_processor.module.lambda_function_container_image.data.aws_iam_policy_document.logs[0]: Reading...
module.email_response_processor.module.lambda_function_container_image.data.aws_iam_policy_document.logs[0]: Read complete after 0s [id=3325663242]
module.ingestion.module.lambda_function_container_image.data.aws_iam_policy_document.logs[0]: Reading...
module.lex_router.module.lambda_function_container_image.data.aws_iam_policy_document.logs[0]: Reading...
data.aws_secretsmanager_secret_version.password: Read complete after 0s [id=arn:aws:secretsmanager:us-east-1:446872271111:secret:vectordb-password-main-strangely-steady-monkfish-dKgTZD|AWSCURRENT]
module.ingestion.module.lambda_function_container_image.data.aws_iam_policy_document.logs[0]: Read complete after 0s [id=52771042]
module.lex_router.module.lambda_function_container_image.data.aws_iam_policy_document.logs[0]: Read complete after 0s [id=3953744684]
module.list_collections.module.lambda_function_container_image.aws_iam_policy.logs[0]: Refreshing state... [id=arn:aws:iam::446872271111:policy/levio-demo-fev-list-collections-dev-role-logs]
module.email_request_processor.module.lambda_function_container_image.aws_iam_policy.logs[0]: Refreshing state... [id=arn:aws:iam::446872271111:policy/levio-demo-fev-email-request-processor-dev-role-logs]
module.inference.module.lambda_function_container_image.data.aws_iam_policy_document.logs[0]: Reading...
module.email_response_processor.module.lambda_function_container_image.aws_iam_policy.additional_inline[0]: Refreshing state... [id=arn:aws:iam::446872271111:policy/levio-demo-fev-email-response-processor-dev-role-inline]
module.inference.module.lambda_function_container_image.data.aws_iam_policy_document.logs[0]: Read complete after 0s [id=2926739739]
module.memory.module.lambda_function_container_image.aws_iam_role_policy_attachment.additional_inline[0]: Refreshing state... [id=levio-demo-fev-memory-dev-role-20240126151710029800000004]
module.memory.module.lambda_function_container_image.aws_iam_policy.logs[0]: Refreshing state... [id=arn:aws:iam::446872271111:policy/levio-demo-fev-memory-dev-role-logs]
module.email_response_processor.module.lambda_function_container_image.aws_iam_policy.logs[0]: Refreshing state... [id=arn:aws:iam::446872271111:policy/levio-demo-fev-email-response-processor-dev-role-logs]
module.ingestion.module.lambda_function_container_image.aws_iam_policy.logs[0]: Refreshing state... [id=arn:aws:iam::446872271111:policy/levio-demo-fev-ingestion-dev-role-logs]
module.lex_router.module.lambda_function_container_image.aws_iam_policy.logs[0]: Refreshing state... [id=arn:aws:iam::446872271111:policy/levio-demo-fev-lex-router-dev-role-logs]
module.email_request_processor.module.lambda_function_container_image.data.aws_iam_policy_document.additional_inline[0]: Reading...
module.inference.module.lambda_function_container_image.aws_iam_policy.logs[0]: Refreshing state... [id=arn:aws:iam::446872271111:policy/levio-demo-fev-inference-dev-role-logs]
module.email_request_processor.module.lambda_function_container_image.data.aws_iam_policy_document.additional_inline[0]: Read complete after 0s [id=2734712511]
module.inference.module.api_gateway.aws_api_gateway_method.api_gateway_method: Refreshing state... [id=agm-d09uj3e9kh-c30cce-GET]
module.list_collections.module.api_gateway.aws_api_gateway_method.api_gateway_method: Refreshing state... [id=agm-d09uj3e9kh-i033qb-GET]
module.email_request_processor.module.lambda_function_container_image.aws_iam_policy.additional_inline[0]: Refreshing state... [id=arn:aws:iam::446872271111:policy/levio-demo-fev-email-request-processor-dev-role-inline]
module.inference.module.api_gateway.module.cors.aws_api_gateway_method._: Refreshing state... [id=agm-d09uj3e9kh-c30cce-OPTIONS]
module.list_collections.module.lambda_function_container_image.aws_iam_role_policy_attachment.logs[0]: Refreshing state... [id=levio-demo-fev-list-collections-dev-role-20240130201651725000000001]
module.list_collections.module.api_gateway.module.cors.aws_api_gateway_method._: Refreshing state... [id=agm-d09uj3e9kh-i033qb-OPTIONS]
module.email_request_processor.module.lambda_function_container_image.aws_iam_role_policy_attachment.logs[0]: Refreshing state... [id=levio-demo-fev-email-request-processor-dev-role-20240221194307033600000001]
module.email_response_processor.module.lambda_function_container_image.aws_iam_role_policy_attachment.logs[0]: Refreshing state... [id=levio-demo-fev-email-response-processor-dev-role-20240221194307124300000002]
module.memory.module.lambda_function_container_image.aws_iam_role_policy_attachment.logs[0]: Refreshing state... [id=levio-demo-fev-memory-dev-role-20240126151710095500000006]
module.ingestion.module.lambda_function_container_image.aws_iam_role_policy_attachment.logs[0]: Refreshing state... [id=levio-demo-fev-ingestion-dev-role-20240126151710031000000005]
module.email_response_processor.module.lambda_function_container_image.aws_iam_role_policy_attachment.additional_inline[0]: Refreshing state... [id=levio-demo-fev-email-response-processor-dev-role-20240221194332717000000003]
module.lex_router.module.lambda_function_container_image.aws_iam_role_policy_attachment.logs[0]: Refreshing state... [id=levio-demo-fev-lex-router-dev-role-20240202183512785600000002]
module.inference.module.api_gateway.aws_lambda_permission.lambda_permission: Refreshing state... [id=AllowExecutionFromAPIGateway-levio-demo-fev-inference-dev]
module.inference.module.lambda_function_container_image.aws_iam_role_policy_attachment.logs[0]: Refreshing state... [id=levio-demo-fev-inference-dev-role-20240126151710029200000003]
module.list_collections.module.api_gateway.aws_lambda_permission.lambda_permission: Refreshing state... [id=AllowExecutionFromAPIGateway-levio-demo-fev-list-collections-dev]
module.inference.module.api_gateway.module.cors.aws_api_gateway_integration._: Refreshing state... [id=agi-d09uj3e9kh-c30cce-OPTIONS]
module.email_request_processor.module.lambda_function_container_image.aws_iam_role_policy_attachment.additional_inline[0]: Refreshing state... [id=levio-demo-fev-email-request-processor-dev-role-20240221194332764500000004]
module.inference.module.api_gateway.module.cors.aws_api_gateway_method_response._: Refreshing state... [id=agmr-d09uj3e9kh-c30cce-OPTIONS-200]
module.list_collections.module.api_gateway.module.cors.aws_api_gateway_integration._: Refreshing state... [id=agi-d09uj3e9kh-i033qb-OPTIONS]
module.email_response_processor.module.lambda_function_container_image.aws_lambda_function.this[0]: Refreshing state... [id=levio-demo-fev-email-response-processor-dev]
module.list_collections.module.api_gateway.module.cors.aws_api_gateway_method_response._: Refreshing state... [id=agmr-d09uj3e9kh-i033qb-OPTIONS-200]
module.inference.module.api_gateway.module.cors.aws_api_gateway_integration_response._: Refreshing state... [id=agir-d09uj3e9kh-c30cce-OPTIONS-200]
module.list_collections.module.api_gateway.module.cors.aws_api_gateway_integration_response._: Refreshing state... [id=agir-d09uj3e9kh-i033qb-OPTIONS-200]
module.email_response_processor.module.lambda_function_container_image.aws_lambda_permission.unqualified_alias_triggers["sqs"]: Refreshing state... [id=sqs]
module.email_response_processor.module.lambda_function_container_image.aws_lambda_event_source_mapping.this["sqs"]: Refreshing state... [id=6372d997-1ffe-4d2e-b58c-8870ba706c3d]
module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-0b9066ddfe118437e]
aws_security_group.lambda_egress_all_sg: Refreshing state... [id=sg-054f9a76901acf353]
aws_security_group.bedrock_sg: Refreshing state... [id=sg-0902cb6d437a968b6]
aws_security_group.sm_sg: Refreshing state... [id=sg-013ee0bdd16b8366f]
module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-0d7ddd92ffe7cad50]
aws_security_group.jumpbox_sg: Refreshing state... [id=sg-0b9900b5db426c576]
module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-086b3e733d88fa370]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-02f9981846a152b24]
module.vpc.aws_subnet.database[0]: Refreshing state... [id=subnet-03f5acb4bc8b5d586]
module.vpc.aws_subnet.database[1]: Refreshing state... [id=subnet-0d1f5f95132e695a6]
module.vpc.aws_route_table.database[1]: Refreshing state... [id=rtb-00ef44a2d775aaa99]
module.vpc.aws_route_table.database[0]: Refreshing state... [id=rtb-0f03a46a772c6a571]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-09be498e3f465bbb5]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-0bbe5e0845bba1093]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-04aae6346ab85dfe5]
aws_security_group.dynamo_db_sg: Refreshing state... [id=sg-0c6d3637458aa4799]
aws_vpc_endpoint.s3_endpoint: Refreshing state... [id=vpce-0fdf03f021658d47f]
aws_security_group.database_sg: Refreshing state... [id=sg-02511ace313a817bd]
aws_vpc_endpoint.dynamo_db_endpoint: Refreshing state... [id=vpce-04b83095daf470dae]
module.vpc.aws_db_subnet_group.database[0]: Refreshing state... [id=ex-terraform-dev]
module.vpc.aws_route_table_association.database[0]: Refreshing state... [id=rtbassoc-044bfd1713e1c30ec]
module.vpc.aws_route_table_association.database[1]: Refreshing state... [id=rtbassoc-0d7135c7f623e06f8]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-02f9981846a152b241080289494]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-066d9aa6005ec7c94]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0db0a8005c04ca4f2]
aws_vpc_endpoint.bedrock_endpoint: Refreshing state... [id=vpce-0a8ed6effde8d7daf]
aws_vpc_endpoint.lambda_endpoint: Refreshing state... [id=vpce-0b1660c4cfd3c329e]
aws_instance.jumpbox: Refreshing state... [id=i-0cd5eadbd064719b1]
aws_vpc_endpoint.secrets_manager_endpoint: Refreshing state... [id=vpce-07b8182fd57a40bc7]
module.lex_router.module.lambda_function_container_image.aws_lambda_function.this[0]: Refreshing state... [id=levio-demo-fev-lex-router-dev]
module.memory.module.lambda_function_container_image.aws_lambda_function.this[0]: Refreshing state... [id=levio-demo-fev-memory-dev]
aws_db_instance.vector_db: Refreshing state... [id=db-KTG3TDKXH3C3BOXFTTIFJ5SASY]
module.list_collections.module.lambda_function_container_image.data.aws_iam_policy_document.additional_inline[0]: Reading...
module.inference.module.lambda_function_container_image.data.aws_iam_policy_document.additional_inline[0]: Reading...
module.ingestion.module.lambda_function_container_image.data.aws_iam_policy_document.additional_inline[0]: Reading...
module.list_collections.module.lambda_function_container_image.data.aws_iam_policy_document.additional_inline[0]: Read complete after 0s [id=1333636943]
module.ingestion.module.lambda_function_container_image.data.aws_iam_policy_document.additional_inline[0]: Read complete after 0s [id=2560015702]
module.list_collections.module.lambda_function_container_image.aws_iam_policy.additional_inline[0]: Refreshing state... [id=arn:aws:iam::446872271111:policy/levio-demo-fev-list-collections-dev-role-inline]
module.inference.module.lambda_function_container_image.data.aws_iam_policy_document.additional_inline[0]: Read complete after 0s [id=242001761]
module.ingestion.module.lambda_function_container_image.aws_iam_policy.additional_inline[0]: Refreshing state... [id=arn:aws:iam::446872271111:policy/levio-demo-fev-ingestion-dev-role-inline]
module.inference.module.lambda_function_container_image.aws_iam_policy.additional_inline[0]: Refreshing state... [id=arn:aws:iam::446872271111:policy/levio-demo-fev-inference-dev-role-inline]
module.ingestion.module.lambda_function_container_image.aws_iam_role_policy_attachment.additional_inline[0]: Refreshing state... [id=levio-demo-fev-ingestion-dev-role-2024012615222186470000000d]
module.list_collections.module.lambda_function_container_image.aws_iam_role_policy_attachment.additional_inline[0]: Refreshing state... [id=levio-demo-fev-list-collections-dev-role-20240202005532784400000004]
module.inference.module.lambda_function_container_image.aws_iam_role_policy_attachment.additional_inline[0]: Refreshing state... [id=levio-demo-fev-inference-dev-role-2024012615222187350000000e]
module.ingestion.module.lambda_function_container_image.aws_lambda_function.this[0]: Refreshing state... [id=levio-demo-fev-ingestion-dev]
module.list_collections.module.lambda_function_container_image.aws_lambda_function.this[0]: Refreshing state... [id=levio-demo-fev-list-collections-dev]
module.inference.module.lambda_function_container_image.aws_lambda_function.this[0]: Refreshing state... [id=levio-demo-fev-inference-dev]
module.ingestion.aws_lambda_event_source_mapping.event_source_mapping: Refreshing state... [id=ffdd3b10-6ac6-4fbf-bbd1-a7e6e82bf9d1]
module.list_collections.module.api_gateway.aws_api_gateway_integration.api_gateway_integration: Refreshing state... [id=agi-d09uj3e9kh-i033qb-GET]
module.inference.module.api_gateway.aws_api_gateway_integration.api_gateway_integration: Refreshing state... [id=agi-d09uj3e9kh-c30cce-GET]
aws_api_gateway_deployment.this: Refreshing state... [id=otd4ml]
aws_api_gateway_stage.this: Refreshing state... [id=ags-d09uj3e9kh-dev]
module.ingestion.aws_s3_bucket_notification.bucket_notification: Refreshing state... [id=levio-demo-fev-storage-dev]
aws_api_gateway_usage_plan.this: Refreshing state... [id=jxe0z0]
module.email_request_processor.module.lambda_function_container_image.aws_lambda_function.this[0]: Refreshing state... [id=levio-demo-fev-email-request-processor-dev]
aws_api_gateway_usage_plan_key.this: Refreshing state... [id=mwfvag0h0f]
module.email_request_processor.module.lambda_function_container_image.aws_lambda_event_source_mapping.this["sqs"]: Refreshing state... [id=f9630eab-ef3d-41c7-bd22-d541cb86d9a8]
module.email_request_processor.module.lambda_function_container_image.aws_lambda_permission.unqualified_alias_triggers["sqs"]: Refreshing state... [id=sqs]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.email_request_processor.module.lambda_function_container_image.aws_lambda_function.this[0] has changed
  ~ resource "aws_lambda_function" "this" {
        id                             = "levio-demo-fev-email-request-processor-dev"
      ~ last_modified                  = "2024-02-21T19:43:36.904+0000" -> "2024-02-21T19:43:56.510+0000"
        # (18 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.email_response_processor.module.lambda_function_container_image.aws_lambda_function.this[0] has changed
  ~ resource "aws_lambda_function" "this" {
        id                             = "levio-demo-fev-email-response-processor-dev"
      ~ last_modified                  = "2024-02-21T19:43:32.905+0000" -> "2024-02-21T19:43:53.023+0000"
        # (18 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
+/- create replacement and then destroy

Terraform will perform the following actions:

  # aws_api_gateway_deployment.this must be replaced
+/- resource "aws_api_gateway_deployment" "this" {
      ~ created_date  = "2024-02-21T19:43:36Z" -> (known after apply)
      ~ description   = "Deployment for 2024-02-21T19:43:35Z" -> (known after apply)
      ~ execution_arn = "arn:aws:execute-api:us-east-1:446872271111:d09uj3e9kh/" -> (known after apply)
      ~ id            = "otd4ml" -> (known after apply)
      ~ invoke_url    = "https://d09uj3e9kh.execute-api.us-east-1.amazonaws.com/" -> (known after apply)
      ~ triggers      = { # forces replacement
          - "redeployment" = "2024-02-21T19:43:35Z"
        } -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # aws_api_gateway_stage.this will be updated in-place
  ~ resource "aws_api_gateway_stage" "this" {
      ~ deployment_id         = "otd4ml" -> (known after apply)
        id                    = "ags-d09uj3e9kh-dev"
        tags                  = {}
        # (9 unchanged attributes hidden)
    }

  # module.email_request_processor.module.lambda_function_container_image.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "levio-demo-fev-email-request-processor-dev"
      ~ image_uri                      = "446872271111.dkr.ecr.us-east-1.amazonaws.com/email_request_processor@sha256:a44232f8ae329b9de96680843e4eaa5f97f23f5c5bd696d99a0e060a9af16d34" -> "446872271111.dkr.ecr.us-east-1.amazonaws.com/email_request_processor@sha256:a07910e3db8292dcccb8e03da29f936cbddd4db1ddad0b29afcce68d449a6cd0"
      ~ last_modified                  = "2024-02-21T19:43:56.510+0000" -> (known after apply)
        tags                           = {}
        # (18 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              - "API_KEY"   = (sensitive value)
              - "API_URL"   = "https://d09uj3e9kh.execute-api.us-east-1.amazonaws.com//dev/inference"
              - "QUEUE_URL" = "https://sqs.us-east-1.amazonaws.com/446872271111/levio-demo-fev-email-response-processor-queue-dev.fifo"
            } -> (known after apply)
        }

        # (3 unchanged blocks hidden)
    }

  # module.email_response_processor.module.lambda_function_container_image.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "levio-demo-fev-email-response-processor-dev"
      ~ image_uri                      = "446872271111.dkr.ecr.us-east-1.amazonaws.com/email_response_processor@sha256:580f418354aee11c642823f61dc2189011db73524bc382049ac16796c9ded18d" -> "446872271111.dkr.ecr.us-east-1.amazonaws.com/email_response_processor@sha256:d36cbea4c86284dc10feec96e8a33b5822c110b8bfbdb124ea8350abc7e5062d"
      ~ last_modified                  = "2024-02-21T19:43:53.023+0000" -> (known after apply)
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.inference.module.lambda_function_container_image.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "levio-demo-fev-inference-dev"
      ~ image_uri                      = "446872271111.dkr.ecr.us-east-1.amazonaws.com/inference@sha256:d676940b1f9fe4fcfbb9c254da9911e302786782bde89fd3f8892e6c3ee322d2" -> "446872271111.dkr.ecr.us-east-1.amazonaws.com/inference@sha256:e0f4458197517081bd2170fb7b56654fe41a25a20d38bb504448735bfbb0e194"
      ~ last_modified                  = "2024-02-21T19:43:06.000+0000" -> (known after apply)
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.ingestion.module.lambda_function_container_image.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "levio-demo-fev-ingestion-dev"
      ~ image_uri                      = "446872271111.dkr.ecr.us-east-1.amazonaws.com/ingestion@sha256:cd9e0205c77acf8e6f5df853a5d71cb1acac8b880f946caefba7a2ee78bd3a82" -> "446872271111.dkr.ecr.us-east-1.amazonaws.com/ingestion@sha256:7129ed47b5edee4cf79729d2ccb4e64e76f5ba1dd9e3373cf233e3f285956a47"
      ~ last_modified                  = "2024-02-21T19:43:06.000+0000" -> (known after apply)
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.lex_router.module.lambda_function_container_image.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "levio-demo-fev-lex-router-dev"
      ~ image_uri                      = "446872271111.dkr.ecr.us-east-1.amazonaws.com/lex_router@sha256:8573c95bbbb88f8f88139ffb3a323e9d15d8697b9810cf6fbc2d61376bb8d80c" -> "446872271111.dkr.ecr.us-east-1.amazonaws.com/lex_router@sha256:ef781dc326e14b8a4af7dd3f52cac4161103297362ff984a8050d27b5710cece"
      ~ last_modified                  = "2024-02-21T19:43:06.000+0000" -> (known after apply)
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.list_collections.module.lambda_function_container_image.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "levio-demo-fev-list-collections-dev"
      ~ image_uri                      = "446872271111.dkr.ecr.us-east-1.amazonaws.com/list_collections@sha256:d7d3053d214375c2f1669cd5b66deb6deaf44e026a39db42a48d659eaf5bb71f" -> "446872271111.dkr.ecr.us-east-1.amazonaws.com/list_collections@sha256:fd5c6f197a3aa7e0825fb033420652aeb3f9dd976a93c24b911f4b418d231ceb"
      ~ last_modified                  = "2024-02-21T19:43:06.000+0000" -> (known after apply)
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.memory.module.lambda_function_container_image.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "levio-demo-fev-memory-dev"
      ~ image_uri                      = "446872271111.dkr.ecr.us-east-1.amazonaws.com/conversation_memory@sha256:3ca6a491ac127dada2b9ca8a470855f761ba0374c1bbc1abfeae1b1468363c7d" -> "446872271111.dkr.ecr.us-east-1.amazonaws.com/conversation_memory@sha256:1afe8003b3a137e28f2b9825dcaeeb5047c13010b309b66eab2cc7a0d19ab51b"
      ~ last_modified                  = "2024-02-21T19:43:06.000+0000" -> (known after apply)
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

Plan: 1 to add, 8 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: terraform.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "terraform.tfplan"

```

</details>

*Pusher: @FloRul, Action: `pull_request`, Workflow: `Deploy Lambdas & Terraform Plan on PR`*